/*
================================================================================================================

یک زبان کوری برای دیتاهای ما هستش که بر اساس اون ها میایم و کوری هامون رو مینویسیم

GraphQL : دقیقا فیلدهایی که میخایم رو بهمون بر میگردونه و باید یک اسکیمایی رو ایجاد بکنیم
و این اسکیما  ها از نوع آبجکت هستتند

دو نوع عملیات داریم  GraphQL ما در 

1 - Query  عملیات هایی مثل خوندن اطلاعات امون رو از این طریق انجام میدهیم

2 - Mutation

GraphQL   ما سرعت بالاتری رو داریم

PlayGrand For GrapQL

================================================================================================================
*/